In [1]:
import os
import pandas as pd
import numpy as np
from data import makeTable as mt

## 영화 데이터 로드 
- user : 고객정보 (users)
- item : 영화정보 (movies)
- data : 평가정보 (ratings)

In [2]:
mt.user()

         age sex     occupation zip_code
user_id
1         24   M     technician    85711
2         53   F          other    94043
3         23   M         writer    32067
4         24   M     technician    43537
5         33   F          other    15213
...      ...  ..            ...      ...
939       26   F        student    33319
940       32   M  administrator    02215
941       20   M        student    97229
942       48   F      librarian    78209
943       22   M        student    77841

[943 rows x 4 columns]

In [2]:
user = mt.user

In [3]:
user